# Задание-1:
# Вывести символы в нижнем регистре, которые находятся вокруг
# 1 или более символов в верхнем регистре.
# Т.е. из строки "mtMmEZUOmcq" нужно получить ['mt', 'm', 'mcq']
# Решить задачу двумя способами: с помощью re и без.
import re 
line = 'mtMmEZUOmcqWiryMQhhTxqKdSTKCYEJlEZCsGAMkgAYEOmHBSQsSUHKvSfbmxULaysmNO'\
       'GIPHpEMujalpPLNzRWXfwHQqwksrFeipEUlTLeclMwAoktKlfUBJHPsnawvjPhfgewVzK'\
       'TUfSYtBydXaVIpxWjNKgXANvIoumesCSSvjEGRJosUfuhRRDUuTQwLlJJJDdkVjfSAHqn'\
       'LxooisBDWuxIhyjJaXDYwdoVPnsllMngNlmkpYOlqXEFIxPqqqgAWdJsOvqppOfyIVjXa'\
       'pzGOrfinzzsNMtBIOclwbfRzytmDgEFUzxvZGkdOaQYLVBfsGSAfJMchgBWAsGnBnWete'\
       'kUTVuPluKRMQsdelzBgLzuwiimqkFKpyQRzOUyHkXRkdyIEBvTjdByCfkVIAQaAbfCvzQ'\
       'WrMMsYpLtdqRltXPqcSMXJIvlBzKoQnSwPFkapxGqnZCVFfKRLUIGBLOwhchWCdJbRuXb'\
       'JrwTRNyAxDctszKjSnndaFkcBZmJZWjUeYMdevHhBJMBSShDqbjAuDGTTrSXZywYkmjCC'\
       'EUZShGofaFpuespaZWLFNIsOqsIRLexWqTXsOaScgnsUKsJxiihwsCdBViEQBHQaOnLfB'\
       'tQQShTYHFqrvpVFiiEFMcIFTrTkIBpGUflwTvAzMUtmSQQZGHlmQKJndiAXbIzVkGSeuT'\
       'SkyjIGsiWLALHUCsnQtiOtrbQOQunurZgHFiZjWtZCEXZCnZjLeMiFlxnPkqfJFbCfKCu'\
       'UJmGYJZPpRBFNLkqigxFkrRAppYRXeSCBxbGvqHmlsSZMWSVQyzenWoGxyGPvbnhWHuXB'\
       'qHFjvihuNGEEFsfnMXTfptvIOlhKhyYwxLnqOsBdGvnuyEZIheApQGOXWeXoLWiDQNJFa'\
       'XiUWgsKQrDOeZoNlZNRvHnLgCmysUeKnVJXPFIzvdDyleXylnKBfLCjLHntltignbQoiQ'\
       'zTYwZAiRwycdlHfyHNGmkNqSwXUrxGc'

#Вариант 1 через re
pattern = '[A-Z]?([a-z]+)[A-Z]?'    #[A-Z]? - 0 или 1 символ в верхнем регистре
                                    #([a-z]+) - возвращает 1 и более символ в нижнем регистре

print(re.findall(pattern, line))

#Вариант 2 через функцию
def split_string(source, splitlist):
    output = []  # результирующий список
    is_split = True
    for char in source:
        if char in splitlist:
            is_split = True
        else:
            if is_split:
                output.append(char)  # добавляем новый элемент в результирующий список
                is_split = False
            else: 
                output[-1] = output[-1] + char  # добавляем символ к последнему элементу
    return output

print(split_string(line,'ABCDEFGHIJKLMNOPQRSTUVWXYZ'))

# Задание-2:
# Вывести символы в верхнем регистре, слева от которых находятся
# два символа в нижнем регистре, а справа - два символа в верхнем регистре.
# Т.е. из строки 
# "GAMkgAYEOmHBSQsSUHKvSfbmxULaysmNOGIPHpEMujalpPLNzRWXfwHQqwksrFeipEUlTLec"
# нужно получить список строк: ['AY', 'NOGI', 'P']
# Решить задачу двумя способами: с помощью re и без.

line_2 = 'mtMmEZUOmcqWiryMQhhTxqKdSTKCYEJlEZCsGAMkgAYEOmHBSQsSUHKvSfbmxULaysm'\
       'NOGIPHpEMujalpPLNzRWXfwHQqwksrFeipEUlTLeclMwAoktKlfUBJHPsnawvjPhfgewV'\
       'fzKTUfSYtBydXaVIpxWjNKgXANvIoumesCSSvjEGRJosUfuhRRDUuTQwLlJJJDdkVjfSA'\
       'HqnLxooisBDWuxIhyjJaXDYwdoVPnsllMngNlmkpYOlqXEFIxPqqqgAWdJsOvqppOfyIV'\
       'jXapzGOrfinzzsNMtBIOclwbfRzytmDgEFUzxvZGkdOaQYLVBfsGSAfJMchgBWAsGnBnW'\
       'etekUTVuPluKRMQsdelzBgLzuwiimqkFKpyQRzOUyHkXRkdyIEBvTjdByCfkVIAQaAbfC'\
       'vzQWrMMsYpLtdqRltXPqcSMXJIvlBzKoQnSwPFkapxGqnZCVFfKRLUIGBLOwhchWCdJbR'\
       'uXbJrwTRNyAxDctszKjSnndaFkcBZmJZWjUeYMdevHhBJMBSShDqbjAuDGTTrSXZywYkm'\
       'jCCEUZShGofaFpuespaZWLFNIsOqsIRLexWqTXsOaScgnsUKsJxiihwsCdBViEQBHQaOn'\
       'LfBtQQShTYHFqrvpVFiiEFMcIFTrTkIBpGUflwTvAzMUtmSQQZGHlmQKJndiAXbIzVkGS'\
       'euTSkyjIGsiWLALHUCsnQtiOtrbQOQunurZgHFiZjWtZCEXZCnZjLeMiFlxnPkqfJFbCf'\
       'KCuUJmGYJZPpRBFNLkqigxFkrRAppYRXeSCBxbGvqHmlsSZMWSVQyzenWoGxyGPvbnhWH'\
       'uXBqHFjvihuNGEEFsfnMXTfptvIOlhKhyYwxLnqOsBdGvnuyEZIheApQGOXWeXoLWiDQN'\
       'JFaXiUWgsKQrDOeZoNlZNRvHnLgCmysUeKnVJXPFIzvdDyleXylnKBfLCjLHntltignbQ'\
       'oiQzTYwZAiRwycdlHfyHNGmkNqSwXUrxGC'

#Вариант 1 через re
pattern_2 = '[a-z]{2,2}([A-Z]+)[A-Z]{2,2}'      #[a-z]{2,2} - 2 символа в нижнем регистре
                                                #([A-Z]+) - возвращает 1 и более символ в верхнем регистре
                                                #[A-Z]{2,2} - 2 символа в верхнем регистре
print(re.findall(pattern_2, line_2))

#Вариант 2 через функцию
line_temp1=split_string(line_2,'abcdefghijklmnopqrstuvwxyz') #создаем список Заглавных строк
line_temp2=split_string(line_2,'ABCDEFGHIJKLMNOPQRSTUVWXYZ') #создаем список мелких строк

if line_2[0] in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ':    #откусываем первый элемент списка, если строка начинается с заглавной   
    line_temp1= line_temp1[1:]

zip_list=list(zip(line_temp2,line_temp1))  #создаем список пар :1-ый элемент строка мелких букв, 2-ой строка Заглавных которые идут в этой же последовательности
rezult_list=[(i[1])[:-2] for i in zip_list if len(i[0])>=2 and len(i[1])>=3]  #генерируем итоговый список по условию задачи

print(rezult_list)

# Задание-3:
# Напишите скрипт, заполняющий указанный файл (самостоятельно задайте имя файла)
# произвольными целыми цифрами, в результате в файле должно быть
# 2500-значное произвольное число.
# Найдите и выведите самую длинную последовательность одинаковых цифр
# в вышезаполненном файле.

import os
import random

path = os.path.join('data', 'big_number.txt')
my_file = open(path, "w", encoding='UTF-8')
random_list = [random.randint(0,9) for i in range(2500)] #Генерируем рандомный список
my_file.write( ''.join(map(str, random_list)) )     #записали наше число в файл
my_file.close()

pattern_3 =r'(\d)\1+'            #цифра повторяющаяся более 1 раза   

with open(path, 'r', encoding='UTF-8') as f:    #ищем по файлу
    rows=f.readlines()
    result = re.finditer( pattern_3, str(rows))
    result_str=''
    for match in result :       #находим первую последовательность с максимальной длиной
        result_str = match.group() if len(match.group())>len(result_str) else result_str
    print(result_str)
